import os

ENGRAVINGS_ABBR = {
    "원한":       ["원한"],
    "돌격대장":   ["돌대", "돌격"],
    "마나 효율 증가": ["마효증", "마나효율증가"],
    "마나의 흐름": ["마흐", "마나의흐름"],
    "예리한 둔기": ["예둔", "예리한둔기"],
    "아드레날린": ["아드"],
    "기습의 대가": ["기습", "기대", "기습의", "기습의대가"],
    "중갑 착용":   ["중착", "중갑", "중갑착용"],
    "슈퍼 차지":   ["슈차", "슈퍼차지"],
    "타격의 대가": ["타대", "타격", "타격의대가"],
    "안정된 상태": ["안상", "안정", "안정된상태"],
    "바리케이드": ["바리", "바리케이드"],
    "정밀 단도":   ["정단", "정밀단도"],
    "속전속결":   ["속속", "속전속결"],
    "각성":       ["각성"],
    "결투의 대가": ["결대", "결투의대가"],
    "급소 타격":   ["급타", "급소타격"],
    "저주받은 인형": ["저받", "저주받은인형"],
    "정기 흡수":   ["정흡", "정기흡수"],
    "질량 증가":   ["질증", "질량증가"],
    "구슬동자":   ["구동"],
    "최대 마나 증가": ["최마증", "최마", "최대마나", "최대마나증가"],
    "선수필승":   ["선필"],
    "탈출의 명수": ["탈출", "탈명", "탈출의명수"],
    "실드관통": ["실관"],
    "굳은 의지": ["의지", "굳은의지"],
    "여신의 가호": ["여가", "가호", "여신의가호"],
    "강화 방패": ["강방", "방패", "강화방패"],
    "부러진 뼈": ["부뼈", "부러진뼈"],
    "약자 무시": ["약무", "약자무시"],
    "위기 모면": ["위모", "위기모면"],
    "달인의 저력": ["달저", "달인의저력"],
    "에테르 포식자": ["에포", "에테르포식자"],
    "시선 집중": ["시집", "시선집중"],
    "폭발물 전문가": ["폭전", "폭발물전문가"],
    "번개의 분노": ["번분", "번개의분노"],
    "분쇄의 주먹": ["분주", "분쇄의주먹"],
}

ENGRAVINGS_ALIAS = {
    alias: engraving
    for engraving, aliases in ENGRAVINGS_ABBR.items()
    for alias in aliases
}
BASE_DIR = os.path.dirname(os.path.abspath(__file__))
LOG_PATH = os.path.join(BASE_DIR, 'bot.log')
KOSPI_TICKER_PATH = os.path.join(BASE_DIR, 'kospi_ticker.json')
TEST_LOG_PATH = os.path.join(BASE_DIR, 'test.log')
TIME_TABLE_PATH = os.path.join(BASE_DIR, 'time_table.json')